////////////////////////////////////////
// CacheImage
// 图片链接缓存
//--------------------------------------
// 如何使用
// var CacheImage = require('src/buzz/CacheImage');
// CacheImage.func();
////////////////////////////////////////

//==============================================================================
// import
//==============================================================================
var _ = require('underscore');
//var StringUtil = require('../../utils/StringUtil');


//==============================================================================
// constant
//==============================================================================
var ERROR = 1;
var DEBUG = 0;


//==============================================================================
// global variable
//==============================================================================
// 使用说明: 暂时不规定大小, 仅在需要时写入, 服务器关闭时不更新数据库
var gImageCache = {};


//==============================================================================
// public
//==============================================================================

//------------------------------------------------------------------------------
// definition
//------------------------------------------------------------------------------
exports.cache = cache;
exports.push = push;
exports.length = length;
exports.contains = contains;
exports.getUrlFromWeb2Local = getUrlFromWeb2Local;


//------------------------------------------------------------------------------
// implement
//------------------------------------------------------------------------------
function cache() {
    return gImageCache;
}

/**
 * 缓存一条图片链接数据
 */
function push(data) {
    gImageCache[data.web_url] = { local_url: data.local_url };
}

/**
 * 获得当前gImageCache的长度
 */
function length() {
    return _.keys(gImageCache).length;
}

/**
 * 根据邮件ID获取一封邮件的全部内容
 */
function getUrlFromWeb2Local(web_url) {
    return gImageCache[web_url];
}

/**
 * 检测缓存中是否存在查询ID指向的邮件.
 */
function contains(web_url) {
    return gImageCache[web_url] != null;
}

